
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.fee_pay_team_telephony_subscription_key
* Update
  * azurerm_api_management_subscription.fee_pay_team_telephony_subscription
  * azurerm_api_management_subscription.pcipal_supplier_subscription
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy
* Delete
  * azurerm_key_vault_secret.fee_pay_team_bulk_scan_subscription_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_telephony_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_telephony_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/5a89d26c-6d91-4997-8a4e-13e4e279ee0a"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.pcipal_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "pcipal_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/ea576e34-00bd-4eff-80d5-85f6c6392bb2"
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.fee_pay_team_bulk_scan_subscription_key will be destroyed
  # (because azurerm_key_vault_secret.fee_pay_team_bulk_scan_subscription_key is not in configuration)
  - resource "azurerm_key_vault_secret" "fee_pay_team_bulk_scan_subscription_key" {
      - id                      = "https://ccpay-aat.vault.azure.net/secrets/fee-pay-team-telephony-cft-apim-subscription-key/817131fa04744908861abee1d06883cd" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat" -> null
      - name                    = "fee-pay-team-telephony-cft-apim-subscription-key" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat/secrets/fee-pay-team-telephony-cft-apim-subscription-key/versions/817131fa04744908861abee1d06883cd" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat/secrets/fee-pay-team-telephony-cft-apim-subscription-key" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "817131fa04744908861abee1d06883cd" -> null
      - versionless_id          = "https://ccpay-aat.vault.azure.net/secrets/fee-pay-team-telephony-cft-apim-subscription-key" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.fee_pay_team_telephony_subscription_key will be created
  + resource "azurerm_key_vault_secret" "fee_pay_team_telephony_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "fee-pay-team-telephony-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "api_policy" {
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/apis/telephony-api"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<inbound>
          - 		<base />
          - 		<choose>
          - 			<when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;68EDF481C5394D65962E9810913455D3EC635FA5&quot;,&quot;13D1848E8B050CE55E4D41A35A60FF4A17E686A6&quot;,&quot;C46826BF1E82DF37664F7A3678E6498D056DA4A9&quot;,&quot;B660C97A7CC2734ABD41FBF9F6ADAA61B0C399D4&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))">
          - 				<return-response>
          - 					<set-status code="403" reason="Invalid client certificate." />
          - 				</return-response>
          - 			</when>
          - 		</choose>
          - 		<!-- generate totp -->
          - 		<set-variable name="client_id" value="api_gw" />
          - 		<set-variable name="client_secret" value="C5OI566EGMPHT3CC" />
          - 		<set-variable name="one_time_password" value="@{
          + <policies>
          +     <backend>
          +         <base/>
          +     </backend>
          +     <inbound>
          +         <base/>
          +         <choose>
          +           <when condition="@(context.Request.Headers["X-ARR-ClientCertThumbprint"] == null)">
          +               <return-response>
          +                 <set-status code="401" />
          +                 <set-body>Missing client certificate.</set-body>
          +               </return-response>
          +           </when>
          +           <when condition="@(!(new string[] {&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;68EDF481C5394D65962E9810913455D3EC635FA5&quot;,&quot;13D1848E8B050CE55E4D41A35A60FF4A17E686A6&quot;,&quot;C46826BF1E82DF37664F7A3678E6498D056DA4A9&quot;,&quot;B660C97A7CC2734ABD41FBF9F6ADAA61B0C399D4&quot;}.Contains(context.Request.Headers[&quot;X-ARR-ClientCertThumbprint&quot;].First().ToUpperInvariant())))">
          +               <return-response>
          +                 <set-status code="401" />
          +                 <set-body>Invalid client certificate.</set-body>
          +               </return-response>
          +           </when>
          +           <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter < DateTime.Now || context.Request.Certificate.NotBefore > DateTime.Now || !(new string[] {&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;68EDF481C5394D65962E9810913455D3EC635FA5&quot;,&quot;13D1848E8B050CE55E4D41A35A60FF4A17E686A6&quot;,&quot;C46826BF1E82DF37664F7A3678E6498D056DA4A9&quot;,&quot;B660C97A7CC2734ABD41FBF9F6ADAA61B0C399D4&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
          +               <return-response>
          +                 <set-status code="401" />
          +                 <set-body>Invalid client certificate. Please check expiry.</set-body>
          +               </return-response>
          +           </when>
          +         </choose>
          +         <!-- generate totp -->
          +         <set-variable name="client_id" value="api_gw" />
          +         <set-variable name="client_secret" value="C5OI566EGMPHT3CC" />
          +         <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = &quot;ABCDEFGHIJKLMNOPQRSTUVWXYZ234567&quot;;
                            var bits = &quot;C5OI566EGMPHT3CC&quot;.ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                                Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] &amp; 0xf;
                            int truncatedHash = hash[offset] &amp; 0x7f;
                            for (int i = 1; i &lt; 4; i++)
                            {
                                truncatedHash &lt;&lt;= 8;
                                truncatedHash |= hash[offset + i] &amp; 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString(&quot;D6&quot;);
          -             }" />
          - 		<send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
          - 			<set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
          - 			<set-method>POST</set-method>
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<set-body>@{
          -                 return new JObject(
          -                 new JProperty("microservice", (string)context.Variables["client_id"]),
          -                 new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
          -                 ).ToString();
          -                 }</set-body>
          - 		</send-request>
          - 		<set-header name="ServiceAuthorization" exists-action="override">
          - 			<value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As&lt;string&gt;())</value>
          - 		</set-header>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          +             }"/>
          +         <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
          +             <set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
          +             <set-method>POST</set-method>
          +             <set-header name="Content-Type" exists-action="override">
          +                 <value>application/json</value>
          +             </set-header>
          +             <set-body>@{
          +                 return new JObject(
          +                 new JProperty("microservice", (string)context.Variables["client_id"]),
          +                 new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
          +                 ).ToString();
          +                 }</set-body>
          +         </send-request>
          + 
          +         <set-header name="ServiceAuthorization" exists-action="override">
          +             <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As&lt;string&gt;())</value>
          +         </set-header>
          +     </inbound>
          +     <outbound>
          +         <base/>
          +     </outbound>
          +     <on-error>
          +         <base/>
          +     </on-error>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1673,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->